Tekla Open API Reference for Tekla Structures 2025
Polygon.MAX_POLYGON_POINTS Field
 The maximum number of polygon points that is typically valid in Tekla Structures.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const int MAX_POLYGON_POINTS = 99
Public Const MAX_POLYGON_POINTS As Integer = 99
Field Value
Type: Int32
See Also
Reference
Polygon Class
Tekla.Structures.Model Namespace